emb4fun/tinyone-ea1062/bootloader/library/tal_ea1062/cpu/nxp/imxrt1060/sdk/v2140/drivers/fsl_flexcan.c
    return fgRet;
}

/*!
 * brief Sub Handler Legacy Rx FIFO Trasfered Events
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 * param result The MB flag number.
 *
 * return the status after handle transfered event.
 */
static status_t FLEXCAN_SubHandlerForLegacyRxFIFO(CAN_Type *base, flexcan_handle_t *handle, uint32_t result)
{
    uint32_t u32mask = 1;
    status_t status  = kStatus_FLEXCAN_UnHandled;

    switch (u32mask << result)
    {
        case kFLEXCAN_RxFifoOverflowFlag:
            status = kStatus_FLEXCAN_RxFifoOverflow;
            break;

        case kFLEXCAN_RxFifoWarningFlag:
            if ((handle->rxFifoFrameNum > 5U) && (0U != (base->IFLAG1 & (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag)))
            {
                for (uint32_t i = 0; i < 5UL; i++)
                {
                    status = FLEXCAN_ReadRxFifo(base, handle->rxFifoFrameBuf);
                    /*
                     * $Branch Coverage Justification$
                     * (kStatus_Success != status) not covered. $ref flexcan_c_ref_1$.
                     */
                    if (kStatus_Success == status)
                    {
                        /* Align the current rxfifo timestamp to the timestamp array by handle. */
                        handle->timestamp[i] = handle->rxFifoFrameBuf->timestamp;
                        handle->rxFifoFrameBuf++;
                        handle->rxFifoFrameNum--;
                        /* Clean Rx Fifo available flag to discard the frame that has been read. */
                        FLEXCAN_ClearMbStatusFlags(base, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag);
                    }
                    else
                    {
                        /*
                         * $Line Coverage Justification$
                         * $ref flexcan_c_ref_1$.
                         */
                        return kStatus_FLEXCAN_RxFifoDisabled;
                    }
                }
                if (handle->rxFifoFrameNum < 5UL)
                {
                    /* Enable data avaliable interrupt. */
                    FLEXCAN_EnableMbInterrupts(base, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag);
                }
                status = kStatus_FLEXCAN_RxFifoBusy;
            }
            else
            {
                /* Should enter case kFLEXCAN_RxFifoFrameAvlFlag but not, means previous transfer may have
                 * overflow*/
                status = kStatus_FLEXCAN_RxFifoWarning;
            }
            break;

        case kFLEXCAN_RxFifoFrameAvlFlag:
            /* Whether still has CAN messages remaining to be received. */
            if (handle->rxFifoFrameNum > 0U)
            {
                status = FLEXCAN_ReadRxFifo(base, handle->rxFifoFrameBuf);
                /*
                 * $Branch Coverage Justification$
                 * (kStatus_Success != status) not covered. $ref flexcan_c_ref_1$.
                 */
                if (kStatus_Success == status)
                {
                    /* Align the current (index 0) rxfifo timestamp to the timestamp array by handle. */
                    handle->timestamp[0] = handle->rxFifoFrameBuf->timestamp;
                    handle->rxFifoFrameBuf++;
                    handle->rxFifoFrameNum--;
                }
                else
                {
                    /*
                     * $Line Coverage Justification$
                     * $ref flexcan_c_ref_1$.
                     */
                    return kStatus_FLEXCAN_RxFifoDisabled;
                }
            }
            if (handle->rxFifoFrameNum == 0U)
            {
                /* Stop receiving Ehanced Rx FIFO when the transmission is over. */
                FLEXCAN_TransferAbortReceiveFifo(base, handle);
                status = kStatus_FLEXCAN_RxFifoIdle;
            }
            else
            {
                /* Continue use data avaliable interrupt. */
                status = kStatus_FLEXCAN_RxFifoBusy;
            }
            break;

        default:
            status = kStatus_FLEXCAN_UnHandled;
            break;
    }

    return status;
}

/*!
 * brief Sub Handler Message Buffer Trasfered Events
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 * param result The MB flag number.
 *
 * return the status after handle transfered event.
 */
static status_t FLEXCAN_SubHandlerForMB(CAN_Type *base, flexcan_handle_t *handle, uint32_t result)
{
    status_t status = kStatus_FLEXCAN_UnHandled;

    /* Get current State of Message Buffer. */
    switch (handle->mbState[result])
    {
        /* Solve Rx Data Frame. */
        case (uint8_t)kFLEXCAN_StateRxData:
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
            if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
            {
                status = FLEXCAN_ReadFDRxMb(base, (uint8_t)result, handle->mbFDFrameBuf[result]);
                if (kStatus_Success == status)
                {
                    /* Align the current index of RX MB timestamp to the timestamp array by handle. */
                    handle->timestamp[result] = handle->mbFDFrameBuf[result]->timestamp;
                    status                    = kStatus_FLEXCAN_RxIdle;
                }
            }
            else
#endif
            {
                status = FLEXCAN_ReadRxMb(base, (uint8_t)result, handle->mbFrameBuf[result]);
                if (kStatus_Success == status)
                {
                    /* Align the current index of RX MB timestamp to the timestamp array by handle. */
                    handle->timestamp[result] = handle->mbFrameBuf[result]->timestamp;
                    status                    = kStatus_FLEXCAN_RxIdle;
                }
            }
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
            if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
            {
                FLEXCAN_TransferFDAbortReceive(base, handle, (uint8_t)result);
            }
            else
#endif
            {
                FLEXCAN_TransferAbortReceive(base, handle, (uint8_t)result);
            }
            break;

        /* Sove Rx Remote Frame.  User need to Read the frame in Mail box in time by Read from MB API. */
        case (uint8_t)kFLEXCAN_StateRxRemote:
            status = kStatus_FLEXCAN_RxRemote;
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
            if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
            {
                FLEXCAN_TransferFDAbortReceive(base, handle, (uint8_t)result);
            }
            else
#endif
            {
                FLEXCAN_TransferAbortReceive(base, handle, (uint8_t)result);
            }
            break;

        /* Solve Tx Data Frame. */
        case (uint8_t)kFLEXCAN_StateTxData:
            status = kStatus_FLEXCAN_TxIdle;
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
            if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
            {
                FLEXCAN_TransferFDAbortSend(base, handle, (uint8_t)result);
            }
            else
#endif
            {
                FLEXCAN_TransferAbortSend(base, handle, (uint8_t)result);
            }
            break;

        /* Solve Tx Remote Frame. */
        case (uint8_t)kFLEXCAN_StateTxRemote:
            handle->mbState[result] = (uint8_t)kFLEXCAN_StateRxRemote;
            status                  = kStatus_FLEXCAN_TxSwitchToRx;
            break;

        default:
            status = kStatus_FLEXCAN_UnHandled;
            break;
    }

